lab11/powerblade/software/nrf51822/apps/powerblade/main.c
/*
 * PowerBlade BLE application
 */

// Standard Libraries
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

// Nordic Libraries
#include "ble.h"
#include "ble_advdata.h"
#include "app_timer.h"
#include "app_util_platform.h"
#include "nrf_uart.h"
#include "nrf_drv_common.h"

// Platform, Peripherals, Devices, & Services
#include "powerblade_states.h"
#include "uart.h"
#include "uart_types.h"
#include "powerblade.h"
#include "led.h"
#include "simple_ble.h"
#include "simple_adv.h"
#include "eddystone.h"
#include "checksum.h"


/**************************************************
 * Function Protoypes
 **************************************************/
void start_eddystone_adv(void);
void init_adv_data(void);
void start_manufdata_adv(void);

void UART0_IRQHandler(void);
void uart_rx_handler(void);
void process_rx_packet(uint16_t packet_len, bool overrun);
void process_additional_data(uint8_t* buf, uint16_t len);
void uart_tx_handler(void);
void uart_send(uint8_t* data, uint16_t len);
void uart_start_receive(void);

void services_init(void);
void ble_evt_write (ble_evt_t* p_ble_evt);

void transmit_message(void);
void on_receive_message(uint8_t* buf, uint16_t len);

void timers_init(void);
int main(void);


/**************************************************
 * Define and Globals
 **************************************************/

// override default configuration
const int SLAVE_LATENCY = 4;
const int FIRST_CONN_PARAMS_UPDATE_DELAY = APP_TIMER_TICKS(100, APP_TIMER_PRESCALER);

// simple_ble configuration for advertising and connections
static const simple_ble_config_t ble_config = {
    .platform_id       = PLATFORM_ID_BYTE,  // used as 4th octet in device BLE address
    .device_id         = DEVICE_ID_DEFAULT, // 5th and 6th octet in device BLE address
    .adv_name          = DEVICE_NAME,       // used in advertisements if there is room
    .adv_interval      = MSEC_TO_UNITS(200, UNIT_0_625_MS),
    .min_conn_interval = MSEC_TO_UNITS(20, UNIT_1_25_MS),
    .max_conn_interval = MSEC_TO_UNITS(50, UNIT_1_25_MS),
};
static simple_ble_app_t* simple_ble_app;

// timer configuration
APP_TIMER_DEF(enable_uart_timer);
APP_TIMER_DEF(start_eddystone_timer);
APP_TIMER_DEF(start_manufdata_timer);
APP_TIMER_DEF(restart_advs_timer);
#define EDDYSTONE_ADV_DURATION      APP_TIMER_TICKS(200, APP_TIMER_PRESCALER)
#define MANUFDATA_ADV_DURATION      APP_TIMER_TICKS(800, APP_TIMER_PRESCALER)
// end of uart message to start of next with guard time
#define UART_SLEEP_DURATION         APP_TIMER_TICKS(960, APP_TIMER_PRESCALER)
// start of uart guard time to start of next guard time, determined empirically
#define UART_SKIP_DURATION          APP_TIMER_TICKS(999, APP_TIMER_PRESCALER)
// skip two cycles during a connection start since those take longer
#define CONNECTION_SKIP_DURATION    2*UART_SKIP_DURATION

// advertisement data
// for https://cdn.rawgit.com/lab11/powerblade/030626a2aa748c0b0d7c3a69d9fd005d6d769667/software/summon/index.html
#define PHYSWEB_URL "j2x.us/6EKY8W"
#define UMICH_COMPANY_IDENTIFIER    0x02E0
#define POWERBLADE_SERVICE_IDENTIFIER 0x11
#define ADV_DATA_MAX_LEN 24 // maximum manufacturer specific advertisement data size
static uint8_t powerblade_adv_data[ADV_DATA_MAX_LEN];
static uint8_t powerblade_adv_data_len = 0;

// service for device configuration
static simple_ble_service_t config_service = {
    .uuid128 = {{0x99, 0xf9, 0xac, 0xe5, 0x57, 0xb9, 0x43, 0xec,
                 0x88, 0xf8, 0x88, 0xb9, 0x4d, 0xa1, 0x80, 0x50}}};

    // holds various configuration values which are broken out in characteristics
    static PowerBladeConfig_t powerblade_config = {0};

    // characteristic to display device status
    static simple_ble_char_t config_status_char = {.uuid16 = 0x4DA2};

    // characteristic to access voltage offset
    static simple_ble_char_t config_voff_char = {.uuid16 = 0x4DA3};

    // characteristic to access current offset
    static simple_ble_char_t config_ioff_char = {.uuid16 = 0x4DA4};

    // characteristic to access current offset post-integration
    static simple_ble_char_t config_curoff_char = {.uuid16 = 0x4DA5};

    // characteristic to access power scaling value
    static simple_ble_char_t config_pscale_char = {.uuid16 = 0x4DA6};

    // characteristic to access voltage scaling value
    static simple_ble_char_t config_vscale_char = {.uuid16 = 0x4DA7};

    // characteristic to access watt-hours scaling value
    static simple_ble_char_t config_whscale_char = {.uuid16 = 0x4DA8};

// service for internal calibration
static simple_ble_service_t calibration_service = {
    .uuid128 = {{0x49, 0x4b, 0x30, 0x70, 0xaa, 0xd5, 0x4e, 0x84,
                 0x9e, 0xd9, 0x61, 0x94, 0xed, 0x0b, 0xc4, 0x57}}};

    // characteristic to hold wattage setpoint
    static simple_ble_char_t calibration_wattage_char = {.uuid16 = 0xED0C};
    static uint16_t calibration_wattage;

    // characteristic to hold voltage setpoint
    static simple_ble_char_t calibration_voltage_char = {.uuid16 = 0xED0D};
    static uint16_t calibration_voltage;

    // characteristic to control internal calibration
    static simple_ble_char_t calibration_control_char = {.uuid16 = 0xED0E};
    static uint8_t calibration_control;

// service for sample data collection
static simple_ble_service_t rawSample_service = {
    .uuid128 = {{0x31, 0x15, 0xd4, 0x39, 0x2a, 0x88, 0x4e, 0x1c,
                 0x8c, 0xcc, 0xf8, 0x7c, 0x01, 0xaf, 0xad, 0xce}}};

    // characteristic to start raw sample collection
    static simple_ble_char_t rawSample_char_begin = {.uuid16 = 0x01B0};
    static bool begin_rawSample;

    // characteristic to provide raw samples to users
    static simple_ble_char_t rawSample_char_data = {.uuid16 = 0x01B1};
    static uint8_t raw_sample_data[SAMDATA_MAX_LEN];

    // characteristic to indicate new data is available
    static simple_ble_char_t rawSample_char_status = {.uuid16 = 0x01B2};
    static uint8_t rawSample_status;

// service for waveform collection
static simple_ble_service_t waveform_service = {
    .uuid128 = {{0x33, 0x3b, 0x60, 0x34, 0x32, 0xa8, 0x1c, 0x93,
                 0x9b, 0x40, 0xda, 0x6c, 0xe3, 0xf1, 0x71, 0x61}}};

    // characteristic to signal waveform data status
    static simple_ble_char_t waveform_char_status = {.uuid16 = 0xE3F2};
    static uint8_t waveform_status;

    // characteristic to hold a waveform to be read
    static simple_ble_char_t waveform_char_data = {.uuid16 = 0xE3F3};
    static uint8_t waveform_data[WAVEFORM_MAX_LEN];

// receiving data items
static bool receiving_bytes = false;
static uint16_t received_len = 0;
static uint16_t rx_index = 0;

