lab11/powerblade/software/nrf51822/apps/powerblade/main.c
// uart buffers
// max length is: total length + adv length + adv data + add type + add data + checksum
#define RX_DATA_MAX_LEN 2+1+ADV_DATA_MAX_LEN+1+SAMDATA_MAX_LEN+1
static uint8_t rx_data[RX_DATA_MAX_LEN];
static uint8_t* tx_data;
static uint16_t tx_data_len = 0;
static uint8_t tx_buffer[4+sizeof(powerblade_config)];
// when receiving long packets, briefly pause advertisements. I've decided that
//  400 bytes is "long" essentially arbitarily
#define LONG_PACKET_THRESHOLD 400

// states for handling transmissions to the MSP
static bool already_transmitted = false;
static NakState_t nak_state = NAK_NONE;
static CalibrationState_t calibration_state = CALIB_NONE;
static RawSampleState_t rawSample_state = RS_NONE;
static ConfigurationState_t config_state = CONF_NONE;
static StartupState_t startup_state = STARTUP_NOP;
static StatusCode_t status_code = STATUS_NONE;
static bool skip_uart_cycle = false;


/**************************************************
 * Advertisements
 **************************************************/

void start_eddystone_adv (void) {
    uint32_t err_code;

    // Advertise physical web address for PowerBlade summon app
    eddystone_adv(PHYSWEB_URL, NULL);

    err_code = app_timer_start(start_manufdata_timer, EDDYSTONE_ADV_DURATION, NULL);
    APP_ERROR_CHECK(err_code);
}

void init_adv_data (void) {
    // Default values, helpful for debugging
    powerblade_adv_data[0] = POWERBLADE_SERVICE_IDENTIFIER; // Service ID

    powerblade_adv_data[1] = 0x01; // Version
    
    powerblade_adv_data[2] = 0x01;
    powerblade_adv_data[3] = 0x01;
    powerblade_adv_data[4] = 0x01;
    powerblade_adv_data[5] = 0x01; // Sequence

    powerblade_adv_data[6] = 0x42;
    powerblade_adv_data[7] = 0x4A; // P_Scale

    powerblade_adv_data[8] = 0x7B; // V_Scale

    powerblade_adv_data[9] = 0x09; // WH_Scale

    powerblade_adv_data[10] = 0x31; // V_RMS

    powerblade_adv_data[11] = 0x08;
    powerblade_adv_data[12] = 0x02; // True Power

    powerblade_adv_data[13] = 0x0A;
    powerblade_adv_data[14] = 0x1A; // Apparent Power

    powerblade_adv_data[15] = 0x00;
    powerblade_adv_data[16] = 0x00;
    powerblade_adv_data[17] = 0x01;
    powerblade_adv_data[18] = 0x0D; // Watt Hours

    powerblade_adv_data[19] = 0x00; // Flags
    powerblade_adv_data_len = 20;
}

void start_manufdata_adv (void) {
    uint32_t err_code;

    // Advertise PowerBlade data payload as manufacturer specific data
    ble_advdata_manuf_data_t manuf_specific_data;
    manuf_specific_data.company_identifier = UMICH_COMPANY_IDENTIFIER;
    manuf_specific_data.data.p_data = powerblade_adv_data;
    manuf_specific_data.data.size   = powerblade_adv_data_len;
    simple_adv_manuf_data(&manuf_specific_data);

    err_code = app_timer_start(start_eddystone_timer, MANUFDATA_ADV_DURATION, NULL);
    APP_ERROR_CHECK(err_code);
}

void restart_advertisements (void) {
    // if our timers were paused, restart them now. There probably isn't any
    //  new data, so starting eddystone first seems like the right call here
    start_eddystone_adv();
}


/**************************************************
 * UART
 **************************************************/

void UART0_IRQHandler (void) {
    if (nrf_uart_event_check(NRF_UART0, NRF_UART_EVENT_RXDRDY)) {
        uart_rx_handler();
    } else if (nrf_uart_event_check(NRF_UART0, NRF_UART_EVENT_TXDRDY)) {
        uart_tx_handler();
    }
}

void uart_rx_handler (void) {
    led_toggle(ERROR_LED);
    // move uart data to buffer
    //Note: be very careful in this function. It's got a higher priority than
    // most of the softdevice and can really screw things up if it takes too
    // long to complete
    nrf_uart_event_clear(NRF_UART0, NRF_UART_EVENT_RXDRDY);
    rx_data[rx_index] = nrf_uart_rxd_get(NRF_UART0);
    rx_index++;
    led_toggle(ERROR_LED);
}

void receive_bytes(void) {
    // check if we have received the entire packet
    //  This can't occur until we have length, adv length, and checksum
    if (rx_index >= 4) {

        // parse out expected packet length
        if (received_len == 0) {
            received_len = (rx_data[0] << 8 | rx_data[1]);

            // we are receiving a packet, restart the sleep timer
            app_timer_start(enable_uart_timer, UART_SLEEP_DURATION, NULL);

            // if we are receiving a long packet, pause advertisements until it's done
            if (received_len > LONG_PACKET_THRESHOLD) {
                advertising_stop();
                app_timer_stop(start_eddystone_timer);
                app_timer_stop(start_manufdata_timer);
                // no need to set a timer to restart them, process_rx_packet
                //  will do so. Unless the CRC is bad, in which case the next
                //  uart transmission will
            }
        }

        if (nrf_uart_errorsrc_get_and_clear(NRF_UART0) == NRF_UART_ERROR_OVERRUN_MASK) {
            // overrun. This data is invalid

            if (received_len == 0) {
                // if the timer wasn't already restarted, do so now
                app_timer_start(enable_uart_timer, UART_SLEEP_DURATION, NULL);
            }

            // if there was an overrun, we'll fail the packet immediately
            receiving_bytes = false;
            process_rx_packet(rx_index, true);
            received_len = 0;
            rx_index = 0;
        } else if (rx_index >= received_len || rx_index >= RX_DATA_MAX_LEN) {
            // process packet if we have all of it
            //NOTE: we aren't doing any kind of check here to ensure that we
            //  aren't waiting forever for an eronously large packet. That'
            //  okay though, because it will reset from zero at next timer
            //  start if it goes longer than the bytes that were actually sent
            //  in the packet. Also, since the current draw when UART is on is
            //  unsustainable, the nRF will just reboot if this occurs and get
            //  back to a good state in any case.
            receiving_bytes = false;
            process_rx_packet(received_len, false);
            received_len = 0;
            rx_index = 0;
        }
    }
}

void process_rx_packet(uint16_t packet_len, bool overrun) {
    static uint8_t rx_count = 0;

