lab11/powerblade/software/nrf51822/apps/powerblade/main.c
    led_init(ERROR_LED);
    led_on(ERROR_LED);

    // Initialization complete
    start_manufdata_adv();
    receiving_bytes = true;
    uart_rx_enable();

    while (1) {
        power_manage();

        // handle input bytes
        if (receiving_bytes) {
            receive_bytes();
        }

        // state machine. Only send one message per second
        if (!already_transmitted) {
            transmit_message();
        }
    }
}

void transmit_message(void) {
    // select message to transmit at this interval
    //  message priority is based on ordering in this function

    if (startup_state == STARTUP_NOP) {
        // skip this first cycle
        already_transmitted = true;
        startup_state = STARTUP_GET_CONFIG;

    } else if (nak_state == NAK_CHECKSUM) {
        // send NAK to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (UART_NAK);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        nak_state = NAK_NONE;

    } else if (nak_state == NAK_RESEND) {
        // resend most recent message to MSP
        uart_send(tx_data, tx_data_len);
        nak_state = NAK_NONE;

    } else if (calibration_state == CALIB_START) {
        // send start message to MSP
        uint16_t length = 2+1+2+2+1; // length (x2), type, wattage (x2), voltage (x2), checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (START_LOCALC);
        tx_buffer[3] = (calibration_wattage >> 8);
        tx_buffer[4] = (calibration_wattage & 0xFF);
        tx_buffer[5] = (calibration_voltage >> 8);
        tx_buffer[6] = (calibration_voltage & 0xFF);
        tx_buffer[7] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_START;

    } else if (calibration_state == CALIB_CONTINUE) {
        // check on the state of the MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (CONT_LOCALC);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_CONTINUE;

    } else if (calibration_state == CALIB_GET_CONFIG) {
        // request new configuration from MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (GET_CONF);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_GET_CONFIG;

    } else if (calibration_state == CALIB_STOP) {
        // send stop message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (DONE_LOCALC);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_STOP;

    } else if (rawSample_state == RS_START) {
        // send start message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (START_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_START;

    } else if (rawSample_state == RS_NEXT) {
        // send next data message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (CONT_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_DATA;

    } else if (rawSample_state == RS_QUIT) {
        // send quit message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (DONE_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_QUIT;

    } else if (config_state == CONF_SET_VALUES) {
        // set configuration values
        uint16_t length = 2+1+sizeof(powerblade_config)+1; // length(x2), type, configuration struct, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (SET_CONF);
        memcpy(&(tx_buffer[3]), (uint8_t*)(&powerblade_config), sizeof(powerblade_config));
        tx_buffer[3+sizeof(powerblade_config)] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        config_state = CONF_NONE;

    } else if (startup_state == STARTUP_GET_CONFIG) {
        // get MSP configuration to display to user
        uint16_t length = 2+1+1; // length(x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (GET_CONF);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        startup_state = STARTUP_GET_VERSION;

    } else if (startup_state == STARTUP_GET_VERSION) {
        // get MSP software version to display to user
        uint16_t length = 2+1+1; // length(x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (GET_VER);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        startup_state = STARTUP_NONE;
    }
}

void on_receive_message(uint8_t* buf, uint16_t len) {
    if (len > 0) {
        // switch on add data type
        uint8_t data_type = buf[0];
        switch (data_type) {
            case WAVEFORM:
                // save waveform if space is available
                if (waveform_status == 0) {
                    if ((len-1) == WAVEFORM_MAX_LEN) {
                        memcpy(waveform_data, &(buf[1]), len-1);
                    }

                    // notify that data is available
                    waveform_status = 1;
                    simple_ble_notify_char(&waveform_char_status);
                }
                break;

            case UART_NAK:
                status_code = STATUS_GOT_NAK;
                simple_ble_notify_char(&config_status_char);
                nak_state = NAK_RESEND;
                break;

