lab11/powerblade/software/nrf51822/apps/powerblade/main.c
            case GET_CONF:
                // updated configuration from the MSP
                if ((len-1) == sizeof(powerblade_config)) {
                    memcpy((uint8_t*)&powerblade_config, &(buf[1]), len-1);
                } else {
                    // data was the wrong size. Report error
                    status_code = STATUS_BAD_CONFIG_SIZE;
                    simple_ble_notify_char(&config_status_char);
                }

                // check if we are waiting on configuration to complete calibration
                if (calibration_state != CALIB_NONE) {
                    calibration_state = CALIB_NONE;
                }
                break;

            case GET_VER:
                // updated configuration from the MSP
                //TODO: copy over version number into some characteristic
                break;

            case START_LOCALC:
                // write status to characteristic
                calibration_control = 1;
                simple_ble_notify_char(&calibration_control_char);

                // MSP has begun interal calibration
                if (calibration_state != CALIB_STOP) {
                    calibration_state = CALIB_CONTINUE;
                }
                break;

            case CONT_LOCALC:
                // MSP is still running internal calibration
                if (calibration_state != CALIB_STOP) {
                    calibration_state = CALIB_CONTINUE;
                }
                break;

            case DONE_LOCALC:
                // write status to characteristic
                calibration_control = 2;
                simple_ble_notify_char(&calibration_control_char);

                // MSP has stopped internal calibration
                calibration_state = CALIB_GET_CONFIG;
                break;

            case START_SAMDATA:
                // MSP acknowledges, wait for data
                if (rawSample_state != RS_QUIT) {
                    rawSample_state = RS_WAIT_DATA;
                }
                break;

            case CONT_SAMDATA:
                // update data
                memcpy(raw_sample_data, &(buf[1]), len-1);
                simple_ble_update_char_len(&rawSample_char_data, len-1);

                // notify user of new data
                rawSample_status = 1;
                simple_ble_notify_char(&rawSample_char_status);
                if (rawSample_state != RS_QUIT) {
                    rawSample_state = RS_IDLE;
                }
                break;

            case DONE_SAMDATA:
                // notify user samples are done
                begin_rawSample = false;
                rawSample_status = 2;
                simple_ble_notify_char(&rawSample_char_status);

                // reset data
                memset(raw_sample_data, 0x00, SAMDATA_MAX_LEN);
                simple_ble_update_char_len(&rawSample_char_data, 1);

                rawSample_state = RS_NONE;
                break;

            default:
                // unhandled uart type. Don't handle it
                break;
        }
    } else {
        // expected a message but didn't receive one. Signal error status over
        //  status characteristic and try to stop whatever state we're in
        if (calibration_state == CALIB_WAIT_START) {
            status_code = STATUS_NO_CALIB_START;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_STOP;
        } else if (calibration_state == CALIB_WAIT_CONTINUE) {
            status_code = STATUS_NO_CALIB_CONTINUE;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_STOP;
        } else if (calibration_state == CALIB_WAIT_GET_CONFIG) {
            status_code = STATUS_NO_CALIB_GET_CONFIG;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_STOP;
        } else if (calibration_state == CALIB_WAIT_STOP) {
            status_code = STATUS_NO_CALIB_STOP;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_NONE;
        } else if (rawSample_state == RS_WAIT_START) {
            status_code = STATUS_NO_RS_START;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            rawSample_state = RS_QUIT;
        } else if (rawSample_state == RS_WAIT_DATA) {
            status_code = STATUS_NO_RS_DATA;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            rawSample_state = RS_QUIT;
        } else if (rawSample_state == RS_WAIT_QUIT) {
            status_code = STATUS_NO_RS_QUIT;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            rawSample_state = RS_NONE;
        }
    }
}

